Tekla Open API Reference for Tekla Structures 2025
BooleanPart.OperativePart Property
 The part that does the boolean operation. When Insert() is called, this field is overwritten with a new part instance which is a copy of the original operative part. This part has the same identifier as the boolean part. Modifications (such as profile change) have to be made through the part instance and not the boolean part instance. The operative part's class must be BooleanOperativeClass.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Part OperativePart { get; set; }
Public Property OperativePart As Part
	Get
	Set
Property Value
Type: Part
See Also
Reference
BooleanPart Class
Tekla.Structures.Model Namespace